Courses/7140/Lectures/Overview/software-qualities.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-26 Wed 09:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Software Quality</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Software Quality</h1>

<div id="outline-container-orgf806c68" class="outline-2">
<h2 id="orgf806c68"><span class="section-number-2">1</span> Collected Opinions</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Hoare on Software Quality, <a href="http://onlinelibrary.wiley.com/doi/10.1002/spe.4380020202/epdf">Software &#x2013; Practice and Experience</a>,
103-105, 1972. [Local copy <a href="../Overview/hoare-quality-1972.pdf">../Overview/hoare-quality-1972.pdf</a>] An
editorial by C. A. R Hoare.  Turing Award winner.  Required
Reading.</li>

<li>A Few Opinions of Professor <a href="./hehner.html">Hehner</a>.  Required Reading.  Retired
prof, U of Toronto. Author of
<a href="http://www.cs.toronto.edu/~hehner/aPToP/">http://www.cs.toronto.edu/~hehner/aPToP/</a> free book.  The course
Formal Methods of Software Design based on the book is available
online free. It includes lectures and transcripts.</li>

<li>Bill Gates at the RSA Conference, 2005: "64% of developers are not
confident in their ability to write secure applications."</li>

<li>"We wouldn't have to spend so much time and effort on network
security if we didn't have such bad software security."  &#x2013; Bruce
Schneier, author of "Applied Cryptography", and "Secrets &amp; Lies:
Digital Security in a Networked World".</li>
</ol>
</div>
</div>

<div id="outline-container-orgd0bb39c" class="outline-2">
<h2 id="orgd0bb39c"><span class="section-number-2">2</span> Current Software Quality</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>"Malicious hackers don't create security holes; they simply
exploit them.  Security holes and vulnerabilities &#x2013; the real root
cause of the problem &#x2013; are the result of bad software design and
implementation."  &#x2013; John Viega &amp; Gary McGraw, authors of
Building Secure Software, 2001.</li>

<li>"Have you ever written a program section with a security hole?
How did you know?" &#x2013; Mark G. Graff &amp; Kenneth R. van Wyk, authors of
"Secure Coding: Principles and Practices"</li>

<li>"There is no software liability &#x2013; no incentive for secure software.
Most developers never learned to produce secure code.  Secure code
often takes a performance hit &#x2013; i.e., the software runs about 1/3
slower &#x2013; something many users don't want to tolerate.  Writing
secure code also takes a lot more time &#x2013; hence, development costs
are higher than usual.  Consequently, the longer development times
and the longer running times discourage developers from writing
secure code."</li>

<li><a href="http://www.gnu.org/philosophy/shouldbefree.html">www.gnu.org/philosophy/ shouldbefree.html</a> Opinion</li>

<li>"Featurism", Performance: Overriding concern, Correctness: some
concern, Security: ??, Privacy: ??</li>

<li>Secure software development is to prevent software crash/ hang/
misbehave &#x2013; any concern??</li>

<li>ACK: Collected from cs.hiram.edu/~obie/cpsc35200/slides/ProgSec1.ppt</li>
</ol>
</div>
</div>



<div id="outline-container-org5106d0f" class="outline-2">
<h2 id="org5106d0f"><span class="section-number-2">3</span> End</h2>
<div class="outline-text-2" id="text-3">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-04-28
</div>
</body>
</html>
